const monoFont = {
  a:"饾棶", b:"饾棷", c:"饾棸", d:"饾棻", e:"饾棽",
  f:"饾棾", g:"饾棿", h:"饾椀", i:"饾椂", j:"饾椃",
  k:"饾椄", l:"饾椆", m:"饾椇", n:"饾椈", o:"饾椉",
  p:"饾椊", q:"饾椌", r:"饾椏", s:"饾榾", t:"饾榿",
  u:"饾槀", v:"饾槂", w:"饾槃", x:"饾槄", y:"饾槅", z:"饾槆",

  A:"饾棓", B:"饾棔", C:"饾棖", D:"饾棗", E:"饾棙",
  F:"饾棛", G:"饾棜", H:"饾棝", I:"饾棞", J:"饾棟",
  K:"饾棡", L:"饾棢", M:"饾棤", N:"饾棥", O:"饾棦",
  P:"饾棧", Q:"饾棨", R:"饾棩", S:"饾棪", T:"饾棫",
  U:"饾棬", V:"饾棭", W:"饾棯", X:"饾棲", Y:"饾棳", Z:"饾棴"
}

export default function stylizedChar(text) {
  return [...text].map(c => monoFont[c] || c).join("")
}